Revit 2024 API
FailureDefinitionRegistry Methods
The FailureDefinitionRegistry type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
FindFailureDefinition
 Finds a specific FailureDefinition by a given FailureDefinitionId.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ListAllFailureDefinitions
 Retrieves all the registered FailureDefinitions.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FailureDefinitionRegistry Class
Autodesk.Revit.DB Namespace